# Binaries
brew 'wget' # file downloader
brew 'htop' # a colorful top alternative
brew 'httpie' # http client
brew 'diff-so-fancy' # good-looking diffs
brew 'stow' # symlink manager
brew 'tldr' # better than help
brew 'bat' # better cat
brew 'fzf' # fuzzy file searcher, used in scripts and in vim
brew 'fd' # fast find
brew 'eza' # ls alternative
brew 'tree' # pretty-print directory contents
brew 'nvim' # vim (latest)
brew 'zoxide' # switch between most used directories
brew 'git' # git version control (latest version)
brew 'pyenv' # tool for Python version management
brew 'pyenv-virtualenv' # pyenv plugin to manage virtualenv
brew 'lazygit' # TUI for git commands
brew 'fnm' # fast node manager

# Apps
cask 'sublime-text' # best text editor

# Fonts
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'