# System
brew 'bat' # better cat
brew 'btop' # better than htop
brew 'cloc' # count lines of code
brew 'fzf' # fuzzy file searcher, used in scripts and in vim
brew 'nvim' # vim
brew 'stow' # symlink manager
brew 'tldr' # better than help
brew 'tree' # pretty-print directory contents
brew 'wget' # file downloader
brew 'zoxide' # switch between most used directories
brew 'nushell'
brew 'starship'

# Development
brew 'fnm' # fast node manager (better nvm)
brew 'go'
brew 'pyenv' # Python version management
brew 'pyenv-virtualenv' # pyenv plugin to manage virtualenv
brew 'postgresql@17'

# brew 'diff-so-fancy' # good-looking diffs
# brew 'lazydocker'

# Apps
cask 'sublime-text' # best text editor
cask 'visual-studio-code'
cask 'cursor'

# Fonts
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'