4ops.terraform
adpyke.vscode-sql-formatter
artdiniz.quitcontrol-vscode
bierner.color-info
biomejs.biome
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
dart-code.dart-code
dart-code.flutter
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
dotjoshjohnson.xml
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
foxundermoon.shell-format
golang.go
graphql.vscode-graphql
graphql.vscode-graphql-syntax
hashicorp.terraform
inferrinizzard.prettier-sql-vscode
jock.svg
mikestead.dotenv
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
pkief.material-icon-theme
prisma.prisma
redhat.java
saoudrizwan.claude-dev
shalldie.background
simonsiefke.svg-preview
stackbreak.comment-divider
streetsidesoftware.code-spell-checker
swiftlydaniel.oklch-color-visualiser
thenuprojectcontributors.vscode-nushell-lang
tyriar.sort-lines
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
yoavbls.pretty-ts-errors
yzhang.markdown-all-in-one