ms-azuretools.vscode-docker-2.0.0
dotjoshjohnson.xml-2.5.1
tomoki1207.pdf-1.2.2-universal
streetsidesoftware.code-spell-checker-4.5.6-universal
ms-vscode.cpptools-extension-pack-1.3.1
ms-vscode.makefile-tools-0.12.17
ms-python.debugpy-2025.18.0-darwin-arm64
ms-azuretools.vscode-containers-2.3.0-universal
stackbreak.comment-divider-0.4.0
graphql.vscode-graphql-0.13.2
jock.svg-1.5.4
4ops.terraform-0.2.5
swiftlydaniel.oklch-color-visualiser-1.0.3
ms-vscode.cpptools-themes-2.0.0
formulahendry.auto-rename-tag-0.1.10
tyriar.sort-lines-1.12.0
foxundermoon.shell-format-7.2.8-universal
esbenp.prettier-vscode-12.3.0-universal
mikestead.dotenv-1.0.1
mhutchie.git-graph-1.30.0-universal
bierner.color-info-0.7.2
gruntfuggly.todo-tree-0.0.215-universal
davidanson.vscode-markdownlint-0.61.1-universal
artdiniz.quitcontrol-vscode-4.0.0-universal
biomejs.biome-3.4.0-universal
.obsolete
extensions.json
ms-vscode-remote.remote-containers-0.394.0
formulahendry.code-runner-0.12.2
prisma.prisma-31.5.0-universal
mechatroner.rainbow-csv-3.3.0-universal
hashicorp.terraform-2.37.7-darwin-arm64
volkerdobler.insertnums-1.0.6-universal
shd101wyy.markdown-preview-enhanced-0.8.20-universal
anysphere.cursorpyright-1.0.10
dbaeumer.vscode-eslint-3.0.20-universal
christian-kohler.npm-intellisense-1.4.5
astro-build.astro-vscode-2.16.8-darwin-arm64
golang.go-0.52.1-universal
hediet.vscode-drawio-1.6.6-universal
ms-vscode.cpptools-1.23.6-darwin-arm64
anthropic.claude-code-2.1.42-darwin-arm64
graphql.vscode-graphql-syntax-1.3.8
bradlc.vscode-tailwindcss-0.14.28-universal
redhat.vscode-yaml-1.19.1-universal
ms-python.python-2025.6.1-darwin-arm64
formulahendry.auto-close-tag-0.5.15
openai.chatgpt-0.4.74-universal
pkief.material-icon-theme-5.31.0-universal
ms-python.vscode-pylance-2024.8.1
ms-vscode.cmake-tools-1.21.36-universal
yzhang.markdown-all-in-one-3.6.3
